HiennNek/M5MangaS3Plus/sdkconfig.defaults
# M5PaperS3 (ESP32-S3, 16MB flash QIO, 8MB PSRAM OPI)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SIZE_8MB=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

CONFIG_FREERTOS_HZ=1000

# S3 defaults to 160 MHz, and PM_DFS_INIT_AUTO uses it as max_freq_mhz.
# Without this the CPU_FREQ_MAX lock in main/cpufreq.cpp only buys 160.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 0 means newlib uses BLKSIZ (128 B) as the stdio buffer, so every fread()
# path (CBZ extract, thumbnail cache) trickles the file in 128-byte reads
# and FATFS never takes its multi-sector shortcut. Costs 8 KB per open file.
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=8192

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# S3 cache defaults are 16 KB I / 32 KB D with 32-byte lines. The JPEG
# decoder is a big hot loop executing from flash, and the sprite writes
# stream through PSRAM, so both defaults cost real time here.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_8WAYS=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
